// Написати функцію яка залогінює користувача, фетчить список ToDo елементів та добавляє їх на фронт (нові мають бути зверху)
import Api from "./api.js";
window.login = () => {
  // Писати код тут
};

// Написати функцію яка реєструє користувача, фетчить список ToDo елементів та добавляє їх на фронт (нові мають бути зверху)
window.register = () => {
  // Писати код тут
};

// Написати функцію яка добавляє ToDo елемент до API та фронта
window.addTodo = () => {
  const input = document.getElementById("descriptionInput");
  // Отримуємо значення із інпута
  const description = input.value;

  // Писати код тут

  // Очищає інпут
  input.value = "";
};

// Написати функцію(приймає id та completed - поточний стан ToDo елемента) яка модифікує Todo елемента на API та фронті.
window.modifyTodo = (_id, completed) => {
  // Писати код тут
};

// Написати функцію(приймає id ) яка видаляє ToDo елемент із API та фронта.
window.removeTodo = (_id) => {
  // Писати код тут
};
